'''
Задание 2
Реализуйте класс«Книга».
Необходимо хранить в полях класса: название, жанр, год публикации.
Реализуйте конструктор по умолчанию и метод для вывода данных.
Реализуйте доступ к отдельным полям класса через методы класса (геттеры
и сеттеры).
Реализуйте метод класса, который принимает в качестве параметра
путь к файлу где содержится информация о книге. Создайте экземпляр класса
используя альтернативный конструктор.
Добавьте классу статическую переменную, которая хранит тип
экземпляра книги. По умолчанию все объекты должны создаваться с типом
«Бумажный экземпляр». Реализуйте метод, который изменяет для отдельного
объекта тип на «Электронный экземпляр».
'''